List<Map<String, dynamic>> ad3yaList = [
  {
    "id": 1,
    "title": "أدعية المغفرة",
    "content": [
      'سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك اللهم وأتوب إليك',
      'اللهم اغفر لي وتب علي',
      'أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ',
      'اللهمَّ نسألك لذّة النظر إلى وجهك الكريم وتحية الملائكة المقرّبين وأن نكون في جنّة النعيم يا رب العالمين',
      "اللهمَّ اغفر لنا ذنوبنا، ووسِّع لنا في دُورنا، وبارك لنا في أرزاقنا",
      'نستغفر الله الذي لا إله إلا هو الحيَّ القيومَ ونتوبُ إليه',
      "اللهمَّ اغفر لنا ذنوبنا كلّها، دِقّها وجِلّها، وأولها وآخرها، وعلانيتها وسرّها",
      "أستغفر الله العظيم لي ولوالدي ولذوي الحقوق عليّ، وللمؤمنين والمؤمنات والمسلمين والمسلمات الأحياء منهم والأموات",
      "اللهمَّ يا بارئ البريات، وغافر الخطيئات، وعالم الخفيات، المطّلع على الضمائر والنيات، يا مَن أحاط بكلّ شيءٍ علماً، ووسع كلّ شيءٍ رحمةً، وقهر كلّ مخلوقٍ عزّةً وحكماً، اغفر لي ذنوبي، وتجاوز عن سيئاتي إنّك أنت الغفور الرحيم",
      "أستغفر الله العظيم الذي لا إله إلّا هو الحي القيوم غفّار الذنوب، أتوب إليك من جميع المعاصي والذنوب والآثام، ومن كلّ ذنبٍ أذنبته عمداً أو خطأ ظاهراً وباطناً، قولاً وفعلاً، في جميع حركاتي وسكناتي وخطراتي وأنفاسي كلّها، من الذنب الذي أعلم ومن الذنب الذي لا أعلم، عدد ما أحاط به العلم وأحصاه الكتاب وخطّه القلم، وعدد ما أوجدته القدرة وخصّصته الإرادة",
    ]
  },
  {
    "id": 2,
    "title": "أدعية الرحمة",
    "content": [
      'اللهم إني أسألُك من فضلِك ورحمتك؛ فإنَّه لا يملُكها إلا أنت',
      'اللهم لك الحمدُ كلُّه، اللهم لا قابضَ لما بسطتَ، ولا مُقَرِّبَ لما باعدتَ، ولا مُباعِدَ لما قرَّبتَ، ولا مُعطِيَ لما منعْتَ، ولا مانع لما أَعطيتَ اللهم ابسُطْ علينا من بركاتِك ورحمتِك وفضلِك ورزقِك',
      'اللهم انصرنا فإنك خير الناصرين، وافتح لنا فأنت خير الفاتحين، واغفر لنا فإنّك خير الغافرين، وارحمنا فإنّك خير الراحمين وارزقنا فإنك خير الرازقين واهدنا ونجّنا من القوم الظالمين',
      'اللهم إنّا نسألك أن ترحمنا وتكشف ما بنا من ضرٍّ وأن تُزيل همومنا وتُذهب وحشة قلوبنا',
    ]
  },
  {
    "id": 3,
    "title": "أدعية الرزق",
    "content": [
      'للهُمّ إني أعوذُ بكَ منَ الهمِّ والحزَنِ، وأعوذُ بكَ منَ العجزِ والكسلِ، وأعوذُ بكَ منَ الجُبنِ والبخلِ، وأعوذُ بكَ مِن غلبةِ الدَّينِ وقهرِ الرجالِ',
      'اللهمَّ مالكَ الملكِ تُؤتي الملكَ مَن تشاءُ، وتنزعُ الملكَ ممن تشاءُ، وتُعِزُّ مَن تشاءُ، وتذِلُّ مَن تشاءُ، بيدِك الخيرُ إنك على كلِّ شيءٍ قديرٌ. رحمنُ الدنيا والآخرةِ ورحيمُهما، تعطيهما من تشاءُ، وتمنعُ منهما من تشاءُ، ارحمْني رحمةً تُغنيني بها عن رحمةِ مَن سواك',
      'اللَّهُمَّ لا مَانِعَ لِما أعْطَيْتَ، ولَا مُعْطِيَ لِما مَنَعْتَ، ولَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ',
      'اللهم صل على سيدنا محمد، وعلى آل محمد، يا ذا الجلال والإكرام، يا قاضي الحاجات، يا أرحم الراحمين، يا حي يا قيوم، لا إله إلا أنت الملك الحق المبين.',
      'اللّهم إنّي أحمدك حمداً كثيراً وأشكرك شكراً كثيراً يليق بجلال وجهك وعظيم سلطانك، اللهم اكفني بحلالك عن حرامك وأغنني بفضلك عمن سواك.',
      'يا مقيل العثرات، يا قاضي الحاجات، اقض حاجتي، وفرج كربتي، وارزقني من حيث لا أحتسب.',
      'للهم ارزقني رزقاً واسعاً حلالاً طيباً من غير كدٍّ، واستجب دعائي من غير رد، وأعوذ بك من الفقر والدّين، اللهم يا رازق السائلين، يا راحم المساكين، ويا ذا القوة المتين، ويا خير الناصرين، يا ولي المؤمنين، يا غيّاث المستغيثين، إياك نعبد وإيّاك نستعين.',
      'اللهم أغننا بحلالك عن حرامك، وتولنا فأنت أرحم الراحمين.',
      'يا كريم، اللّهم يا ذا الرّحمة الواسعة يا مطّلعاً على السرائر والضّمائر والهواجس والخواطر، لا يعزب عنك شيء، أسألك فيضة من فيضان فضلك، وقبضة من نور سلطانك، وأنساً وفرجاً من بحر كرمك، أنت بيدك الأمر كلّه ومقاليد كل شيءٍ فهب لنا ما تقرّ به أعيننا وتغنينا عن سؤال غيرك، فإنّك واسع الكرم، كثير الجود، حسن الشِّيَم، فبابك واقفون ولجودك الواسع المعروف منتظرون يا كريم يا رحيم.',
      'اللهم ارزقنا رزقا حلالاً طيباً مباركاً فيه كما تحب وترضى يا رب العالمين',
    ]
  },
  {
    "id": 4,
    "title": "أدعية قيام الليل",
    "content": [
      'اللهم اقضي حاجتي وفرج كربتي وارحمني ولا تبتليني وارزقني واكرمني من حيث لا احتسب يارب العالمين',
      'اللهم إنا نَسأَلُكَ من الخيرِ كُلِّهِ عاجِلِهِ وآجِلِهِ ما عَلِمْنَا منه وما لم نَعْلَمْ، ونعوذُ بك من الشر كله عاجِلِهِ وآجِلِهِ ما عَلِمْنَا من وما لم نَعْلَمْ. ونسألكَ الجَنَّة وما قَرَّبَ إليها مِنْ قولٍ أو عمل، ونعوذ بك من النارِ وما قَرَّب إليها مِنْ قولٍ أو عمل. ونسألك من خيرِ ما سألكَ عَبْدُكَ ونَبِيُّكَ، ونعوذُ بك من شر ما استعاذك منه عبدُكَ ونبيكُ. ونسألكَ أن تجعلَ كُلَّ قضاءٍ قَضَيْتَهُ لنا خيرًا. اللهم إنا نسألكَ العَفْوَ والعافيةَ والمُعَافاةَ في الدنيا والآخرةِ، يا ذا الجَلالِ والإِكْرامِ، يا حيُّ يا قيوم.',
      'اللَّهُمَّ إنِّي أَعُوذُ بكَ مِن زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ',
      'اللَّهمَّ إنِّي عَبدُك، وابنُ عبدِك، وابنُ أمتِك، ناصِيَتي بيدِكَ، ماضٍ فيَّ حكمُكَ، عدْلٌ فيَّ قضاؤكَ، أسألُكَ بكلِّ اسمٍ هوَ لكَ سمَّيتَ بهِ نفسَك، أو أنزلْتَه في كتابِكَ، أو علَّمتَه أحدًا من خلقِك، أو استأثرتَ بهِ في علمِ الغيبِ عندَك، أن تجعلَ القُرآنَ ربيعَ قلبي، ونورَ صَدري، وجَلاءَ حَزَني، وذَهابَ هَمِّي',
      'عن أنس بن مالك رضي الله تعالى عنه قال: « كان أكثرَ دعاءِ النبيِّ صلَّى اللهُ عليه وسلَّم: "اللهم ربَّنا آتِنا في الدنيا حسنةً، وفي الآخِرةِ حسنةً، وقِنا عذابَ النارِ» (البخاري:6389)',
      "اللهمَّ يا مُقيل العثرات، ويا قاضي الحاجات، اقضِ حاجتي، وفرّج كربتي، وارزقني من حيث لا أحتسب",
      "اللهمَّ أنت السميع العليم تعلم ما بي وما علي، اللهمَّ إنّي أرجو نجاةً ممّا أنا فيه وأنت أرحم الراحمين",
      "اللهمّ إنّا نسألك عملاً باراً، ورزقاً داراً، وعيشاً قاراً"
    ]
  },
  {
    "id": 5,
    "title": "أدعية تفريج الهم",
    "content": [
      "إلهي هب لي فرجاً بالقدرة التي تحيي بها الحي والميت، ولا تهلكني وعرّفني الإجابة يا رب، ارفعني وانصرني وارزقني وعافني",
      "اللهمَّ إنّي أسألك فرجاً قريباً، وصبراً جميلاً، ورزقاً واسعاً، والعافية من البلايا، وشكر العافية والشكر عليها، وأسألك الغنى من الناس ولاحول ولا قوة إلّا بالله العلي العظيم",
      "اللهمَّ صلّ على سيدنا محمد وعلى آل سيدنا محمدٍ، اللهمَّ إنّي أسألك بحقّ السائلين، وبأسمائك العظمى والحسنى أن تكفيني شرّ ما أخاف وأحذر فإنّك تكفي ذلك الأمر",
      "اللهمَّ لا طاقة لي بالجهد ولا قوة لي على البلاء، فلا تحرمني العافية والرزق ولا تكلني إلى خلقك بل تفرّد لي بحاجتي وتولّني برحمتك، فإنّك إن وكّلتني إلى نفسي عجزت عنها، وإن وكّلتني إلى خلقك ظلموني وحرموني وقهروني ومنّوا عليّ، فبفضلك يا الله أغنني، وابسط لي، واكفني، وخلصني واجعل رضاي فيما يرد عليّ منك، وبارك لي فيما رزقتني وفيما خوّلتني واجعلني في كلّ حالاتي محفوظ مجار، واقضِ عنّي كلّ ما علي لك في وجه من وجوه طاعتك أو لخلقك، فأنت تعلم عظم ضعفي وكثرة ذنوبي وضعف بدني وقوتي وغفلتي، فأدي ما لهم علي عندك يا عظيم فإنّك واسعٌ كريمٌ",
      "اللهم يا حيّ يا مُحيي، يا كافي يا كريم، أجرني في مصيبتي بالرضى والعفو والعافية، والمعافاة الدائمة، في الدنيا والآخرة، والعوض الصالح في الزوج، والأهل والجسد والمال والأصحاب والعمل والذريّة، إنّك على كل شيءٍ قديرٍ، وارحمني برحمتك واكشف ما نزل بي من ضرٍّ، وخلفني خلاصاً جميلاً عاجلاً غير آجل",
      "اللهمَّ يا فارج الهم ويا كاشف الغمّ، مُجيب دعوة المضطرين، رحمن الدنيا والآخرة ورحيمهما، ارحمني رحمةً من عندك تغني بها عن رحمة مَن سواك، اللهمَّ اكشف ضرّي يا مفرّج الهموم، لا إله إلا أنت سبحانك إني كنت من الظالمين",
      "يا مُجيب دعوة المضطرين، اللهمَّ فرّج عني ما ضاق به صدري، وعجز معه صبري، وقلّت فيه حيلتي، وضعفت له قوتي، تحصّنت بعزّتك وعظمتك وبجلالك",
      "يا فارج الغمّ اجعل لي من أمري فرجاً ومخرجاً، يا سامع كلّ شكوى وكاشف كلّ كربٍ، أدعوك يا إلهي دعاء مَن اشتدت فاقته، وضعفت قوته، وقلّت حيلته، دعاء الملهوف المكروب الذي لا يجد كشف ما نزل به غيرك"
    ]
  },
];
